Revit 2024 API
WorksetDefaultVisibilitySettings Class
 An object that manages default visibility of worksets in a document.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public class WorksetDefaultVisibilitySettings : Element
Visual Basic
Public Class WorksetDefaultVisibilitySettings _
	Inherits Element
Visual C++
public ref class WorksetDefaultVisibilitySettings : public Element
Remarks
 WorksetDefaultVisibilitySettings does not exist for family documents. In case worksharing is disabled in a document, all elements are moved into a single workset; that workset, and any worksets (re)created if worksharing is re-enabled, is visible by default regardless of any current settings.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.WorksetDefaultVisibilitySettings
See Also
WorksetDefaultVisibilitySettings Members
Autodesk.Revit.DB Namespace